# 10.	Найти расстояние между двумя точками простран
x = int(input('введите координату точки "А" трехмерного пространства Х: '))
y = int(input('введите координату точки "А" трехмерного пространства Y: '))
z = int(input('введите координату  точки "А" трехмерного пространства Z: '))
print(f'точка "А" имеет координаты: {x}, {y}, {z}')
x1 = int(input('введите координату точки "B" трехмерного пространства Х: '))
y1 = int(input('введите координату точки "B" трехмерного пространства Y: '))
z1 = int(input('введите координату  точки "B" трехмерного пространства Z: '))
print(f'точка "B" имеет координаты: {x1}, {y1}, {z1}')
distance = (abs(x-x1), abs(y-y1), abs(z-z1))
print(f'расстояние между точками А и В в пространстве: ={distance}')
